## Pandas 2

In [20]:
import pandas as pd
import sqlalchemy as sa
import pyodbc 


df = pd.read_csv('student.csv')
csv_df = df[df['Extension'] == 'csv']
txt_df = df[df['Extension'] == 'txt']
sql_df = df[df['Extension'] == 'sql']



csv_df.to_csv('data/student.csv',index=False)
txt_df.to_csv('data/student.txt',index=False)

conn_str = "mssql+pyodbc://@DESKTOP-CSSCKLQ/Data?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes"
engine = sa.create_engine(conn_str)
connection = engine.connect()
sql_df.to_sql('student', connection, index=False, if_exists='replace')
print('Success')

Success

In [21]:
df.sort_values(['Extension', 'Age'],ascending=[True,False])

   ID  Name  Age Extension
6   7   Ann   26       csv
1   2  Sara   25       csv
4   5  Alex   23       csv
2   3   Ann   26       sql
5   6  Sara   25       sql
3   4   Bek   25       txt
7   8   Bek   25       txt
0   1  Alex   23       txt

In [52]:
d = {
    'Student': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'A'],
    'math' : [56, 67,75,34,85,83,49,80],
    'physics': [96, 57,65,74,65,53,69,78]
}

df = pd.DataFrame(d)
df

  Student  math  physics
0       A    56       96
1       B    67       57
2       C    75       65
3       D    34       74
4       E    85       65
5       F    83       53
6       G    49       69
7       A    80       78

In [34]:
# series

df['math']

0    56
1    67
2    75
3    34
4    85
5    83
6    49
7    80
Name: math, dtype: int64

In [35]:
# dataframe

df[['math', 'physics']]

   math  physics
0    56       96
1    67       57
2    75       65
3    34       74
4    85       65
5    83       53
6    49       69
7    80       78

In [36]:
df.set_index('Student')

         math  physics
Student
A          56       96
B          67       57
C          75       65
D          34       74
E          85       65
F          83       53
G          49       69
A          80       78

In [37]:
df

  Student  math  physics
0       A    56       96
1       B    67       57
2       C    75       65
3       D    34       74
4       E    85       65
5       F    83       53
6       G    49       69
7       A    80       78

In [38]:
df.set_index('Student',inplace=True)
df

         math  physics
Student
A          56       96
B          67       57
C          75       65
D          34       74
E          85       65
F          83       53
G          49       69
A          80       78

In [39]:
df

         math  physics
Student
A          56       96
B          67       57
C          75       65
D          34       74
E          85       65
F          83       53
G          49       69
A          80       78

In [ ]:
df.loc['B':'D', ['math','physics']]
df.loc['B':'D', ['math','physics']]

         math  physics
Student
B          67       57
C          75       65
D          34       74

In [43]:
df.loc['B':'D', 'math':'physics']

         math  physics
Student
B          67       57
C          75       65
D          34       74

In [46]:
# no index named as B. B, D are label

df.iloc['B':'D']

TypeError: cannot do positional indexing on Index with these indexers [B] of type str

In [ ]:
# even rows are in index

df.iloc[0:3, 0:1]

         math
Student
A          56
B          67
C          75

In [50]:
df.sort_values('math')

         math  physics
Student
D          34       74
G          49       69
A          56       96
B          67       57
C          75       65
A          80       78
F          83       53
E          85       65

In [53]:
df.sort_values('math',ascending=False)

  Student  math  physics
4       E    85       65
5       F    83       53
7       A    80       78
2       C    75       65
1       B    67       57
0       A    56       96
6       G    49       69
3       D    34       74

In [54]:
df.sort_values(['Student', 'math'])

  Student  math  physics
0       A    56       96
7       A    80       78
1       B    67       57
2       C    75       65
3       D    34       74
4       E    85       65
5       F    83       53
6       G    49       69

In [55]:
df.sort_values(['Student', 'math'], ascending=[True, False])

  Student  math  physics
7       A    80       78
0       A    56       96
1       B    67       57
2       C    75       65
3       D    34       74
4       E    85       65
5       F    83       53
6       G    49       69

In [56]:
# nlargest - same as top 


df.nlargest(3, 'math')

  Student  math  physics
4       E    85       65
5       F    83       53
7       A    80       78

In [58]:
# mean, mode, median


ls = [1,2,2,3,4,3,5,6,3,5,3,5,5,5]

ser = pd.Series(ls)
print(ser.median())
print(ser.mode())
print(ser.mean())

3.5
0    5
dtype: int64
3.7142857142857144

In [59]:
df

  Student  math  physics
0       A    56       96
1       B    67       57
2       C    75       65
3       D    34       74
4       E    85       65
5       F    83       53
6       G    49       69
7       A    80       78

In [61]:
filt = df['math'] > df['math'].mean()

df[filt]

  Student  math  physics
1       B    67       57
2       C    75       65
4       E    85       65
5       F    83       53
7       A    80       78

In [62]:
filt = df['math'] > df['math'].mean()

# not - ~

df[~filt]

  Student  math  physics
0       A    56       96
3       D    34       74
6       G    49       69

In [63]:
df['Student'].value_counts()

Student
A    2
B    1
C    1
D    1
E    1
F    1
G    1
Name: count, dtype: int64

In [64]:
df.value_counts()

Student  math  physics
A        56    96         1
         80    78         1
B        67    57         1
C        75    65         1
D        34    74         1
E        85    65         1
F        83    53         1
G        49    69         1
Name: count, dtype: int64

In [72]:
df = pd.read_csv('employee.csv')


filter1 = df['DEPARTMENT'].isin(['Houston Police Department-HPD', 'Houston Fire Department (HFD)'])

df[filter1]

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE
2,2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,Active,2015-02-03,2015-02-03
3,3,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Full Time,Male,Active,1982-02-08,1991-05-25
5,5,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black or African American,Full Time,Male,Active,1984-11-26,2005-03-26
10,10,FIRE FIGHTER,Houston Fire Department (HFD),52644.0,Hispanic/Latino,Full Time,Male,Active,2007-05-21,2008-11-15
14,14,POLICE SERGEANT,Houston Police Department-HPD,77076.0,Black or African American,Full Time,Male,Active,2001-06-04,2015-05-25
...,...,...,...,...,...,...,...,...,...,...
1995,1995,POLICE OFFICER,Houston Police Department-HPD,43443.0,White,Full Time,Male,Active,2014-06-09,2015-06-09
1996,1996,COMMUNICATIONS CAPTAIN,Houston Fire Department (HFD),66523.0,Black or African American,Full Time,Male,Active,2003-09-02,2013-10-06
1997,1997,POLICE OFFICER,Houston Police Department-HPD,43443.0,White,Full Time,Male,Active,2014-10-13,2015-10-13
1998,1998,POLICE OFFICER,Houston Police Department-HPD,55461.0,Asian/Pacific Islander,Full Time,Male,Active,2009-01-20,2011-07-02
1999,1999,FIRE FIGHTER,Houston Fire Department (HFD),51194.0,Hispanic/Latino,Full Time,Male,Active,2009-01-12,2010-07-12

In [73]:
df = pd.read_csv('employee.csv')


filter1 = df['DEPARTMENT'].isin(['Houston Police Department-HPD', 'Houston Fire Department (HFD)'])
filter2 = df['GENDER'] == 'Female'
filter3 = df['BASE_SALARY'].between(80000,120000)
columns = ['UNIQUE_ID', 'DEPARTMENT', 'BASE_SALARY', 'GENDER']
fin_filt = filter1 & filter2 & filter3
df.loc[fin_filt, columns]

      UNIQUE_ID                     DEPARTMENT  BASE_SALARY  GENDER
61           61  Houston Fire Department (HFD)      96668.0  Female
136         136  Houston Police Department-HPD      81239.0  Female
367         367  Houston Police Department-HPD      86534.0  Female
474         474  Houston Police Department-HPD      91181.0  Female
513         513  Houston Police Department-HPD      81239.0  Female
564         564  Houston Police Department-HPD      81239.0  Female
595         595  Houston Police Department-HPD      99953.0  Female
937         937  Houston Police Department-HPD      81239.0  Female
954         954  Houston Police Department-HPD      91181.0  Female
1118       1118  Houston Police Department-HPD     104455.0  Female
1519       1519  Houston Police Department-HPD      91181.0  Female
1565       1565  Houston Police Department-HPD      81239.0  Female
1622       1622  Houston Police Department-HPD      91181.0  Female

In [54]:
df = pd.read_csv('employee.csv')
filt1 = df['EMPLOYMENT_STATUS'] == 'Active' 
filt2 = df['GENDER'] == 'Male'
filt3 = df['BASE_SALARY'] > 100000
filt4 = df['POSITION_TITLE'] == 'POLICE OFFICER'
filt_final = filt1 & filt2 & filt3 & filt4
df[filt_final]

Empty DataFrame
Columns: [UNIQUE_ID, POSITION_TITLE, DEPARTMENT, BASE_SALARY, RACE, EMPLOYMENT_TYPE, GENDER, EMPLOYMENT_STATUS, HIRE_DATE, JOB_DATE]
Index: []